#pragma once

class MEMORY {
private:
	int** Field_state = new int* [10]; // состояние поля
	int** Field_result = new int* [10];
	int x = 0; // координата по горизонтали
	int y = 0; // координата по вертикали
	int direct = 0; // направление (0 - вниз, 1 - влево, 2 - вверх, 3 - вправо)
	int markers = 0;
	int Commands[206] = { 11,21,1,1,11,2,11,11,11,21,2,2,11,1,11,11,11,2,11,11,1,11,21,2,2,11,2,11,11,2,11,11,1,11,2,11,11,2,11,11,11,2,11,21,2,2,11,11,11,1,11,21,1,1,11,2,11,11,2,11,11,11,2,11,11,1,11,21,1,1,11,2,11,11,2,11,11,1,11,2,11,11,2,11,11,11,2,11,21,2,2,11,11,11,1,11,21,1,1,11,2,11,11,2,11,11,11,2,11,11,1,11,21,1,1,11,2,11,11,2,11,11,1,11,2,11,11,11,11,1,11,21,1,1,11,2,11,11,1,11,11,11,2,11,21,1,1,11,11,11,1,11,21,1,1,11,2,11,11,2,11,11,11,11,22,11,1,11,22,2,11,22,11,1,11,22,11,1,11,22,2,11,22,11,1,11,22,11,1,11,22,2,11,22,11,1,11,22,11,1,11,22,2,11,22,31 };
	int k = -1;
public:
	int get_Commands();
	int* get_x();
	int* get_y();
	int* get_direct();
	int* get_markers();
	int** get_Field_state();
	int** get_Field_result();
};
